УТ.УчетЗадач/src/InformationRegisters/cbr_СтатусыЗадач/cbr_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_СтатусыЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.cbr_СтатусыЗадач</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/Enums/СпособыУстановкиВремениНапоминания/СпособыУстановкиВремениНапоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыУстановкиВремениНапоминания</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Периодически</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтносительноТекущегоВремени</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВУказанноеВремя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтносительноВремениПредмета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Enums/cbr_ПодпискаДляТриггера/cbr_ПодпискаДляТриггера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ПодпискаДляТриггера</name>
  <enumValues>
    <name>ПроведениеДокументаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииНаСервереФормыЗадачи</name>
  </enumValues>
  <enumValues>
    <name>КнопкаЗакрытияЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаВопросПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВопросаПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗадание</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Catalogs/cbr_Триггеры/cbr_Триггеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_Триггеры</name>
  <owners>Catalog.cbr_СтатусыЗадач</owners>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписка</name>
    <type>
      <types>EnumRef.cbr_ПодпискаДляТриггера</types>
    </type>
  </attributes>
  <attributes>
    <name>Уведомлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.УчетЗадач/src/CommonModules/cbr_ОбработкаТриггеровВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ВызовТриггера(Подписка, Задача = Неопределено) Экспорт
	cbr_Битрикс24.ОтправитьЗадачуВБитрикс(Задача);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_Триггеры.Запрос,
		|	cbr_Триггеры.Ссылка,
		|	cbr_Триггеры.Уведомлять,
		|	cbr_Триггеры.Владелец как Статус,
		|	cbr_Триггеры.Наименование
		|ПОМЕСТИТЬ вт_Триггер
		|ИЗ
		|	Справочник.cbr_Триггеры КАК cbr_Триггеры
		|ГДЕ
		|	cbr_Триггеры.Подписка = &Подписка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Триггер.Запрос КАК Запрос,
		|	вт_Триггер.Ссылка КАК Ссылка,
		|	вт_Триггер.Уведомлять КАК Уведомлять,
		|	вт_Триггер.Статус КАК Статус,
		|	cbr_ТриггерыПараметры.Параметр,
		|	cbr_ТриггерыПараметры.Значение,
		|	вт_Триггер.Наименование КАК Наименование
		|ИЗ
		|	вт_Триггер КАК вт_Триггер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_Триггеры.Параметры КАК cbr_ТриггерыПараметры
		|		ПО вт_Триггер.Ссылка = cbr_ТриггерыПараметры.Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Запрос) КАК Запрос,
		|	МАКСИМУМ(Уведомлять) КАК Уведомлять,
		|	МАКСИМУМ(Наименование) КАК Наименование,
		|	МАКСИМУМ(Статус) КАК Статус
		|ПО
		|	Ссылка";
	Запрос.УстановитьПараметр("Подписка", Подписка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Попытка
			 ВыполнениеЗапросаИзСправочника(Выборка, Задача);		
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка Выполнения");
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнениеЗапросаИзСправочника(СправочникКонтроля, Задача)
	Запрос = Новый Запрос;
	Запрос.Текст = СправочникКонтроля.Запрос;
	ВыборкаПараметровКонтроля = СправочникКонтроля.Выбрать();
	Пока ВыборкаПараметровКонтроля.Следующий() Цикл
		Запрос.УстановитьПараметр(ВыборкаПараметровКонтроля.Параметр, ВыборкаПараметровКонтроля.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Задача", Задача);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ТекущаяДата = ТекущаяДатаСеанса();
		Если Выборка.Владелец().Колонки.Найти("Ссылка") <> Неопределено Тогда
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				РегистрыСведений.cbr_СтатусыЗадач.ЗаписатьСтатусЗадачи(Выборка.Ссылка, СправочникКонтроля.Статус,
					ТекущаяДата);
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;

		Если СправочникКонтроля.Уведомлять И Выборка.Владелец().Колонки.Найти("Пользователь") <> Неопределено Тогда
			Если ЗначениеЗаполнено(Выборка.Пользователь) Тогда
				ТекстНапоминания = Строка(Выборка.Пользователь) + " " + Строка(СправочникКонтроля.Наименование);
				ПериодичностьНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.Периодически;
				cbr_УведомленияПользователей.ОтправитьУведомлениеПользователю(Выборка.Пользователь, ТекстНапоминания,
					ТекущаяДата, ТекущаяДата, ПериодичностьНапоминания, 60, Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ВызовТриггераРегЗаданием() Экспорт
	ВызовТриггера(Перечисления.cbr_ПодпискаДляТриггера.РегламентноеЗадание);
КонецПроцедуры
#КонецОбласти
